---------------------------------- 셀프 조인 ------------------------------------
--셀프조인 선택 기준
--1)테이블에 사용하고자 하는 모든 컬럼명이 존재 할때
--2)출력시 수평으로 컬럼정보를 나열하여 출력하고자 할때
select c1.st_name, c1.st_grade, c2.st_name, c2.st_grade, c1.dep_code
from classes c1, classes c2 --같은 테이블에 다른 별칭을 주어 마치 2개의 테이블처럼
where c1.dep_code = c2.dep_code--사용한다.
and c1.st_grade < c2.st_grade;
--------------------------------------------------------------------------------
------------------------------- 카타시안 조인 ------------------------------------
--where 조건식 제외
SELECT c.ST_CODE, c.ST_NAME, d.DEP_CODE, d.DEP_NAME
  FROM classes c,
       department d;
--------------------------------------------------------------------------------
